In [236]:
import pandas as pd

## Primera parte

In [237]:
df = pd.read_csv('titanic.csv', header=0, sep=',')
df = pd.DataFrame(df)

In [238]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [239]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [240]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [241]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [353]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Sex            891
Age            891
SibSp          891
Parch          891
Fare           891
Embarked       889
dtype: int64

In [354]:
df.drop(columns=['Survived']).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Sex          891 non-null    int64
 3   Age          891 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(1)
memory usage: 55.8+ KB

In [355]:
df['Survived'].describe()

count    891.000000
mean       0.383838
std        0.486592
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        1.000000
Name: Survived, dtype: float64

In [243]:
df = df.drop(columns=['Ticket','Name','Cabin'])
df

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,male,22.0,1,0,7.2500,S
1,2,1,1,female,38.0,1,0,71.2833,C
2,3,1,3,female,26.0,0,0,7.9250,S
3,4,1,1,female,35.0,1,0,53.1000,S
4,5,0,3,male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,13.0000,S
887,888,1,1,female,19.0,0,0,30.0000,S
888,889,0,3,female,NaN,1,2,23.4500,S
889,890,1,1,male,26.0,0,0,30.0000,C
890,891,0,3,male,32.0,0,0,7.7500,Q

In [244]:
df.replace({'male':0,'female':1},inplace=True)
df['Sex'] = df['Sex'].map({1:1,0:0})

In [245]:
df.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    0  22.0      1      0   7.2500        S
1            2         1       1    1  38.0      1      0  71.2833        C
2            3         1       3    1  26.0      0      0   7.9250        S
3            4         1       1    1  35.0      1      0  53.1000        S
4            5         0       3    0  35.0      0      0   8.0500        S

In [246]:
from sklearn.impute import SimpleImputer
import numpy as np
im_mean=SimpleImputer(missing_values=np.nan, strategy='mean')
im_mean=im_mean.fit(df[['Age']])
df['Age'] = im_mean.transform(df[['Age']])

In [247]:
one_hot_df = pd.get_dummies(df, prefix=['Embarked'])
one_hot_df

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,0,22.000000,1,0,7.2500,0,0,1
1,2,1,1,1,38.000000,1,0,71.2833,1,0,0
2,3,1,3,1,26.000000,0,0,7.9250,0,0,1
3,4,1,1,1,35.000000,1,0,53.1000,0,0,1
4,5,0,3,0,35.000000,0,0,8.0500,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,0,27.000000,0,0,13.0000,0,0,1
887,888,1,1,1,19.000000,0,0,30.0000,0,0,1
888,889,0,3,1,29.699118,1,2,23.4500,0,0,1
889,890,1,1,0,26.000000,0,0,30.0000,1,0,0
890,891,0,3,0,32.000000,0,0,7.7500,0,1,0

## Segunda parte

## Preprocesamiento del dataset. Transformaciones previas necesarias para la modelación

In [328]:
X = one_hot_df.drop(columns=['Survived'])

In [330]:
Y = one_hot_df['Survived']

In [331]:
from sklearn.preprocessing import StandardScaler

In [332]:
variableEntradaEscalar = StandardScaler()

In [333]:
variableObejtivaEscalar =  StandardScaler()

In [334]:
#Tienen que estar todos los valores numericos
#Ya que en IA solo puede clasificar mediante numeros 
variableEntradaEscalarFit = variableEntradaEscalar.fit(X)

In [336]:
Y = pd.DataFrame(Y)#Por el motivo ques se esperaba una matriz en 2D
#Si no llego a realizar ese paso, me da un error por motivo que es una matriz de 1D
variableObejtivaEscalarFit = variableObejtivaEscalar.fit(Y)

In [352]:
X = variableEntradaEscalarFit.transform(X)
Y = variableObejtivaEscalarFit.transform(Y)

## División del dataset en datos de entrenamiento y datos de test

In [347]:
from sklearn.model_selection import train_test_split
#Código que realice la división en entrenamiento y test, de acuerdo con la estretgia de evaluación planeada. Describa cuál es.
#Dividimos los datos del dataset.
X_train, X_test, y_train, y_test = train_test_split(one_hot_df.drop(columns=['Survived']), one_hot_df['Survived'], test_size=0.3, random_state=0)

#Visualizacion de los datos obtenidos
X_train.shape, X_test.shape

((623, 10), (268, 10))

## Support Vector Machine (SVM)

In [348]:
#Comprobación rápida del tamaño de los conjuntos de datos de entrenamiento y prueba
print(X_train.shape)
print(y_train.shape)
print(X_test.shape)
print(y_test.shape)

(623, 10)
(623,)
(268, 10)
(268,)

In [349]:
from sklearn import svm
from sklearn import metrics
# create a svm classifier with linear kernel
clf = svm.SVC(kernel='linear')

# train the model
clf.fit(X_train, y_train)

# predict the response for the test dataset
y_pred = clf.predict(X_test)

In [350]:
### Evaluate the model

# Model Accuracy: how often is the classifier correct?
print("Accuracy:", metrics.accuracy_score(y_test, y_pred))

# Model Precision: what percentage of positive tuples are labeled as such?
print("Precision:", metrics.precision_score(y_test, y_pred))

# Model Recall: what percentage of positive tuples are labelled as such?
print("Recall:", metrics.recall_score(y_test, y_pred))

Accuracy: 0.7873134328358209
Precision: 0.7171717171717171
Recall: 0.71

In [351]:
from sklearn.tree import DecisionTreeClassifier
# create Decision Tree classifier object
clf2 = DecisionTreeClassifier(criterion="entropy", max_depth=3)

# train Decision Tree Classifier
clf2 = clf2.fit(X_train,y_train)

# predict the response for test dataset
y_pred = clf2.predict(X_test)

# compute model accuracy
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

Accuracy: 0.8208955223880597

In [344]:
one_hot_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked_C     0
Embarked_Q     0
Embarked_S     0
dtype: int64